# Regiment

### Introduction:

Special thanks to: http://chrisalbon.com/ for sharing the dataset and materials.

### Step 1. Import the necessary libraries

In [0]:
import numpy as np
import pandas as pd

### Step 2. Create the DataFrame with the following values:

In [0]:
raw_data = {'regiment': ['Nighthawks', 'Nighthawks', 'Nighthawks', 'Nighthawks', 'Dragoons', 'Dragoons', 'Dragoons', 'Dragoons', 'Scouts', 'Scouts', 'Scouts', 'Scouts'], 
        'company': ['1st', '1st', '2nd', '2nd', '1st', '1st', '2nd', '2nd','1st', '1st', '2nd', '2nd'], 
        'name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze', 'Jacon', 'Ryaner', 'Sone', 'Sloan', 'Piger', 'Riani', 'Ali'], 
        'preTestScore': [4, 24, 31, 2, 3, 4, 24, 31, 2, 3, 2, 3],
        'postTestScore': [25, 94, 57, 62, 70, 25, 94, 57, 62, 70, 62, 70]}

### Step 3. Assign it to a variable called regiment.
#### Don't forget to name each column

In [0]:
regiment=pd.DataFrame(raw_data)

In [5]:
regiment.head()

  company      name  postTestScore  preTestScore    regiment
0     1st    Miller             25             4  Nighthawks
1     1st  Jacobson             94            24  Nighthawks
2     2nd       Ali             57            31  Nighthawks
3     2nd    Milner             62             2  Nighthawks
4     1st     Cooze             70             3    Dragoons

### Step 4. What is the mean preTestScore from the regiment Nighthawks?

In [6]:
regiment[regiment.regiment=='Nighthawks']['preTestScore'].mean()

15.25

### Step 5. Present general statistics by company

In [8]:
regiment.describe().T

               count       mean        std   min    25%   50%   75%   max
postTestScore   12.0  62.333333  21.376850  25.0  57.00  62.0  70.0  94.0
preTestScore    12.0  11.083333  12.324833   2.0   2.75   3.5  24.0  31.0

In [11]:
regiment.groupby('company').agg(['mean','count','sum','min','max','median','std']).T

company                      1st         2nd
postTestScore mean     57.666667   67.000000
              count     6.000000    6.000000
              sum     346.000000  402.000000
              min      25.000000   57.000000
              max      94.000000   94.000000
              median   66.000000   62.000000
              std      27.485754   14.057027
preTestScore  mean      6.666667   15.500000
              count     6.000000    6.000000
              sum      40.000000   93.000000
              min       2.000000    2.000000
              max      24.000000   31.000000
              median    3.500000   13.500000
              std       8.524475   14.652645

### Step 6. What is the mean each company's preTestScore?

In [12]:
regiment.groupby('company')['preTestScore'].mean()

company
1st     6.666667
2nd    15.500000
Name: preTestScore, dtype: float64

### Step 7. Present the mean preTestScores grouped by regiment and company

In [13]:
regiment.groupby(['regiment','company'])['preTestScore'].mean()

regiment    company
Dragoons    1st         3.5
            2nd        27.5
Nighthawks  1st        14.0
            2nd        16.5
Scouts      1st         2.5
            2nd         2.5
Name: preTestScore, dtype: float64

### Step 8. Present the mean preTestScores grouped by regiment and company without heirarchical indexing

In [20]:
regiment.groupby(['regiment', 'company']).preTestScore.mean().unstack()

company      1st   2nd
regiment
Dragoons     3.5  27.5
Nighthawks  14.0  16.5
Scouts       2.5   2.5

### Step 9. Group the entire dataframe by regiment and company

In [21]:
regiment.groupby(['regiment', 'company']).mean()

                    postTestScore  preTestScore
regiment   company
Dragoons   1st               47.5           3.5
           2nd               75.5          27.5
Nighthawks 1st               59.5          14.0
           2nd               59.5          16.5
Scouts     1st               66.0           2.5
           2nd               66.0           2.5

### Step 10. What is the number of observations in each regiment and company

In [22]:
regiment.groupby(['regiment','company']).count()

                    name  postTestScore  preTestScore
regiment   company
Dragoons   1st         2              2             2
           2nd         2              2             2
Nighthawks 1st         2              2             2
           2nd         2              2             2
Scouts     1st         2              2             2
           2nd         2              2             2

In [23]:
regiment.groupby(['regiment','company']).size()

regiment    company
Dragoons    1st        2
            2nd        2
Nighthawks  1st        2
            2nd        2
Scouts      1st        2
            2nd        2
dtype: int64

### Step 11. Iterate over a group and print the name and the whole data from the regiment

In [25]:
for name, group in regiment.groupby('regiment'):
  print ("{} , {}".format(name, group))

Dragoons ,   company    name  postTestScore  preTestScore  regiment
4     1st   Cooze             70             3  Dragoons
5     1st   Jacon             25             4  Dragoons
6     2nd  Ryaner             94            24  Dragoons
7     2nd    Sone             57            31  Dragoons
Nighthawks ,   company      name  postTestScore  preTestScore    regiment
0     1st    Miller             25             4  Nighthawks
1     1st  Jacobson             94            24  Nighthawks
2     2nd       Ali             57            31  Nighthawks
3     2nd    Milner             62             2  Nighthawks
Scouts ,    company   name  postTestScore  preTestScore regiment
8      1st  Sloan             62             2   Scouts
9      1st  Piger             70             3   Scouts
10     2nd  Riani             62             2   Scouts
11     2nd    Ali             70             3   Scouts